#define _WIN32_WINNT 0x0501 
#define WINVER 0x0501 
#define NTDDI_VERSION 0x05010000
#define WIN32_LEAN_AND_MEAN
#include <Windows.h>
#include <vector>

#pragma region GiveCallback
//#include <commctrl.h>
//
//// C RunTime Header Files
//#include <stdlib.h>
//#include <malloc.h>
//#include <memory.h>
//#include <tchar.h>
//
//
//#include <psapi.h>
//#pragma comment( lib, "psapi.lib" )
//using std::string;
//
//
////-----------------------------------------------------------------------------
//
//HMODULE WINAPI GetRemoteModuleHandle( HANDLE hProcess , LPCSTR lpModuleName )
//{
//	HMODULE* ModuleArray = NULL;
//	DWORD ModuleArraySize = 100;
//	DWORD NumModules = 0;
//	CHAR lpModuleNameCopy[ MAX_PATH ] = { 0 };
//	CHAR ModuleNameBuffer[ MAX_PATH ] = { 0 };
//
//	/* Make sure we didn't get a NULL pointer for the module name */
//	if ( lpModuleName == NULL )
//		goto GRMH_FAIL_JMP;
//
//	/* Convert lpModuleName to all lowercase so the comparison isn't case sensitive */
//	for ( size_t i = 0; lpModuleName[ i ] != '\0'; ++i )
//	{
//		if ( lpModuleName[ i ] >= 'A' && lpModuleName[ i ] <= 'Z' )
//			lpModuleNameCopy[ i ] = lpModuleName[ i ] + 0x20; // 0x20 is the difference between uppercase and lowercase
//		else
//			lpModuleNameCopy[ i ] = lpModuleName[ i ];
//
//		lpModuleNameCopy[ i + 1 ] = '\0';
//	}
//
//	/* Allocate memory to hold the module handles */
//	ModuleArray = new HMODULE[ ModuleArraySize ];
//
//	/* Check if the allocation failed */
//	if ( ModuleArray == NULL )

//					RealFunctionId.erase( 0 , 1 ); // Remove '#' from string
//
//					/* My version of atoi() because I was to lazy to use the real one... */
//					for ( size_t i = 0; i < RealFunctionId.size( ); ++i )
//					{
//						if ( RealFunctionId[ i ] >= '0' && RealFunctionId[ i ] <= '9' )
//						{
//							RealOrdinal *= 10;
//							RealOrdinal += RealFunctionId[ i ] - '0';
//						}
//						else
//							break;
//					}
//
//					/* Recursively call this function to get return value */
//					TempReturn = GetRemoteProcAddress( hProcess , RealModule , NULL , RealOrdinal , TRUE );
//				}
//				else // Exported by name
//				{
//					/* Recursively call this function to get return value */
//					TempReturn = GetRemoteProcAddress( hProcess , RealModule , RealFunctionId.c_str( ) , 0 , FALSE );
//				}
//
//				/* Give back that memory */
//				delete[ ] ExportFunctionTable;
//				delete[ ] ExportNameTable;
//				delete[ ] ExportOrdinalTable;
//
//				/* Success!!! */
//				return TempReturn;
//			}
//			else // Not Forwarded
//			{
//
//				/* Make a temporary variable to hold return value*/
//				FARPROC TempReturn;
//
//				/* NOTE:
//				/* Microsoft's PE/COFF specification says we need to subtract the ordinal base
//				/*from the value in the ordinal table but that seems to always give the wrong function */
//				//TempReturn = (FARPROC)(RemoteModuleBaseVA + ExportFunctionTable[ExportOrdinalTable[i] - ExportTable.Base]);
//
//				/* So we do it this way instead */
//				TempReturn = ( FARPROC ) ( RemoteModuleBaseVA + ExportFunctionTable[ ExportOrdinalTable[ i ] ] );
//
//				/* Give back that memory */
//				delete[ ] ExportFunctionTable;
//				delete[ ] ExportNameTable;
//				delete[ ] ExportOrdinalTable;
//
//				/* Success!!! */
//				return TempReturn;
//			}
//		}
//
//		/* Wrong function let's try the next... */
//	}
//
//	/* Uh Oh... */
//GRPA_FAIL_JMP:
//
//	/* If we got to the point where we allocated memory we need to give it back */
//	if ( ExportFunctionTable != NULL )
//		delete[ ] ExportFunctionTable;
//	if ( ExportNameTable != NULL )
//		delete[ ] ExportNameTable;
//	if ( ExportOrdinalTable != NULL )
//		delete[ ] ExportOrdinalTable;
//
//	/* Falure... */
//	return NULL;
//}
#pragma endregion

typedef void *( __fastcall * GetBtnAddrGAME )( char * a2 , int  INDEX );
GetBtnAddrGAME GetBtnAddr_p;

bool initializedgamedll = false;

int GameDll = 0;

UINT gamecache = 0;

bool ingame = false;

bool IsLagScreen( )
{
	return GetBtnAddr_p( "SuspendDropPlayersButton" , 0 ) > 0;
}

bool IsGame( ) // my offset + public
{
	return *( int* ) ( ( DWORD ) GameDll + 0xACF678 ) > 0 || *( int* ) ( ( DWORD ) GameDll + 0xAB62A4 ) > 0;
}


char * DoTheMagic( UINT32 JSID )
{
	DWORD Convert = GameDll + 0x459640;
	DWORD GetCurrentJassEnvironment = GameDll + 0x44B2E0;
	char * cRet;

	__asm
	{
		push JSID;
		mov ecx , 1;
		call GetCurrentJassEnvironment;
		mov ecx , eax;
		call Convert;
		mov ecx , dword ptr ds : [ eax + 0x08 ];
		mov eax , dword ptr ds : [ ecx + 0x1C ];
		mov cRet , eax;
	}

	return cRet;
}


struct JassStringData
{
	DWORD vtable;
	DWORD refCount;
	DWORD dwUnk1;
	DWORD pUnk2;
	DWORD pUnk3;
	DWORD pUnk4;
	DWORD pUnk5;
	char *data;
};


struct JassString
{
	DWORD vtable;
	DWORD dw0;
	JassStringData *data;
	DWORD dw1;
};


struct JassStringClearStruct
{
	JassString * jstring;
	int timer;
};


std::vector<JassStringClearStruct> JassStringCleanList;

void GetJassString( char *szString , JassString *String )
{
	int Address = GameDll + 0x011300;


	__asm
	{
		PUSH szString;
		MOV ECX , String;
		CALL Address;
	}
}

struct ReadDotaInfoStruct
{
	int hero;     // 4
	int kills;       // 8
	int deaths;      // 12
	int assists;     // 16
	int creeps;      // 20
	int gold;        // 24
	int towers;      // 28
	int couriers;      // 32
	int item1;    // 36
	int item2;    // 40
	int item3;    // 44 
	int item4;    // 48
	int item5;    // 52
	int item6;    // 56
};

struct ActionStruct
{
	int actionid;
	int player1id;
	int player2id;
	int actiondata;
};


int Player( int id )
{
	switch ( id )
	{
		case 6:
			return 7;
		case 7:
			return 8;
		case 8:
			return 9;
		case 9:
			return 10;
		case 10:
			return 11;

		default:
			break;
	}

	return id;
}

JassString * fordetect;
JassString * jData;
JassString * jGlobal;
JassString * jWinner;
JassString * jM;
JassString * jS;
JassString * jThrone;
JassString * jTree;
JassString * jGameStart;

typedef void( __cdecl * pStoreInteger )( UINT cache , JassString *missionKey , JassString *key , int value );
pStoreInteger StoreInteger;

typedef void( __cdecl * pSyncStoredInteger )( UINT cache , JassString *missionKey , JassString *key );
pSyncStoredInteger SyncStoredInteger;

typedef int( __cdecl * pGetStoredInteger )( UINT cache , JassString *missionKey , JassString *key );
pGetStoredInteger GetStoredInteger;

void SetTlsForMe( )
{
	DWORD Data = *( DWORD * ) ( GameDll + 0xACEB4C );
